; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-58)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on b1 b11)
    (on-table b11)
    (clear b3)
    (on b3 b9)
    (on b9 b2)
    (on b2 b12)
    (on b12 b5)
    (on b5 b17)
    (on b17 b13)
    (on b13 b10)
    (on b10 b15)
    (on b15 b8)
    (on b8 b14)
    (on b14 b16)
    (on b16 b6)
    (on b6 b4)
    (on b4 b7)
    (on-table b7))
 (:goal (and 
(on b11 b9)
))
)

; plan
1. (unstack b1 b11)
   deleted: (on b1 b11) (clear b1) (arm-empty)
   added: (holding b1) (clear b11)
   goals met: 0 of 1
2. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 0 of 1
3. (unstack b3 b9)
   deleted: (on b3 b9) (clear b3) (arm-empty)
   added: (holding b3) (clear b9)
   goals met: 0 of 1
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 0 of 1
5. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 0 of 1
6. (stack b11 b9)
   deleted: (clear b9) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b9)
   goals met: 1 of 1
